spec/cassettes/Create_payment_on_successful_charge/creates_the_payment_with_the_webhook_from_stripe_for_charge_succeeded.yml

---
http_interactions:
- request:
    method: get
    uri: https://api.stripe.com/v1/events/evt_172rS9GeF17FCPJ2TqL3lnvx
    body:
      encoding: US-ASCII
      string: ''
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.30.2
      Authorization:
      - Bearer sk_test_2gB1xh7jwrowOkemhCZrhR4N
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.30.2","lang":"ruby","lang_version":"2.1.2 p95 (2014-05-08)","platform":"x86_64-darwin13.0","engine":"ruby","publisher":"stripe","uname":"Darwin
        qa-pc.multi-function.local 15.0.0 Darwin Kernel Version 15.0.0: Sat Sep 19
        15:53:46 PDT 2015; root:xnu-3247.10.11~1/RELEASE_X86_64 x86_64","hostname":"qa-pc.multi-function.local"}'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Tue, 03 Nov 2015 01:19:58 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '1993'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_7HSNgiaIKSxmWb
      Stripe-Version:
      - '2015-10-16'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "id": "evt_172rS9GeF17FCPJ2TqL3lnvx",
          "object": "event",
          "api_version": "2015-10-16",
          "created": 1446505865,
          "data": {
            "object": {
              "id": "ch_172rS9GeF17FCPJ2xT8kGcEz",
              "object": "charge",
              "amount": 999,
              "amount_refunded": 0,
              "application_fee": null,
              "balance_transaction": "txn_172rS9GeF17FCPJ2l4KitQGM",
              "captured": true,
              "created": 1446505865,
              "currency": "usd",
              "customer": "cus_7HQIILg3mFplK1",
              "description": null,
              "destination": null,
              "dispute": null,
              "failure_code": null,
              "failure_message": null,
              "fraud_details": {},
              "invoice": "in_172rS9GeF17FCPJ28ucdsLby",
              "livemode": false,
              "metadata": {},
              "paid": true,
              "receipt_email": null,
              "receipt_number": null,
              "refunded": false,
              "refunds": {
                "object": "list",
                "data": [],
                "has_more": false,
                "total_count": 0,
                "url": "/v1/charges/ch_172rS9GeF17FCPJ2xT8kGcEz/refunds"
              },
              "shipping": null,
              "source": {
                "id": "card_172rS7GeF17FCPJ2lL7nekoF",
                "object": "card",
                "address_city": null,
                "address_country": null,
                "address_line1": null,
                "address_line1_check": null,
                "address_line2": null,
                "address_state": null,
                "address_zip": null,
                "address_zip_check": null,
                "brand": "Visa",
                "country": "US",
                "customer": "cus_7HQIILg3mFplK1",
                "cvc_check": "pass",
                "dynamic_last4": null,
                "exp_month": 11,
                "exp_year": 2015,
                "fingerprint": "lBuC8qY1FR9nqFir",
                "funding": "credit",
                "last4": "4242",
                "metadata": {},
                "name": null,
                "tokenization_method": null
              },
              "statement_descriptor": "MyFLix Base Plan",
              "status": "succeeded"
            }
          },
          "livemode": false,
          "pending_webhooks": 0,
          "request": "req_7HQIvG9DKHNBB2",
          "type": "charge.succeeded"
        }
    http_version: 
  recorded_at: Tue, 03 Nov 2015 01:19:58 GMT
recorded_with: VCR 2.9.3
